Revit 2024 API
Form.AreProfilesConstrained Property
Get/set if the form's profiles are constrained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool AreProfilesConstrained { get; set; }
Visual Basic
Public Property AreProfilesConstrained As Boolean
	Get
	Set
Visual C++
public:
property bool AreProfilesConstrained {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property to 'true' This operation can only be performed on a swept blend form.
See Also
Form Class
Autodesk.Revit.DB Namespace